<?php

namespace App\Config;

class Helpers
{
    public static function getColorHex($colorName)
    {
        $colors = [
            'Белый' => '#ffffff',
            'Чёрный' => '#000000',
            'Серый' => '#808080',
            'Красный' => '#ff0000',
            'Синий' => '#0000ff',
            'Зелёный' => '#008000',
            'Серебристый' => '#c0c0c0',
            'Золотистый' => '#ffd700',
            'Графитовый' => '#474747',
            'Бронзовый' => '#cd7f32',
            'Платиновый' => '#e5e4e2',
            'Голубой' => '#00ffff',
            'Розовый' => '#ffc0cb',
            'Мятный' => '#98ff98',
            'Лавандовый' => '#e6e6fa',
            'Персиковый' => '#ffdab9',
            'Хамелеон' => '#4b0082',
            'Карбоновый' => '#333333',
            'Жемчужный' => '#f0f0f0',
            'Ультрамарин' => '#3f00ff',
            'Коралловый' => '#ff7f50',
            'Чёрно-белый' => 'linear-gradient(45deg, #000 50%, #fff 50%)',
            'Красно-чёрный' => 'linear-gradient(45deg, #ff0000 50%, #000 50%)',
            'Сине-серебристый' => 'linear-gradient(45deg, #0000ff 50%, #c0c0c0 50%)',
            'Оранжево-графитовый' => 'linear-gradient(45deg, #ffa500 50%, #474747 50%)'
        ];

        return $colors[$colorName] ?? '#ffffff';
    }
}
